<?php

return [
    'name' => 'Блок',
    'create' => 'Нови блок',
    'menu' => 'Статички блокови',
    'static_block_short_code_name' => 'Статички блок',
    'static_block_short_code_description' => 'Додај прилагођени статички блок',
    'alias' => 'Алиас',
    'content_helper_text' => 'Треба да буде само текст, слика, листа... Ако желите да користите специјалне HTML ознаке, користите поље Сирови садржај. Ово поље ће бити игнорисано ако се користи Сирови садржај.',
    'raw_content' => 'Сирови садржај (HTML ознаке прихваћене, без CSS/JS)',
    'raw_content_placeholder' => 'За специјални HTML код...',
    'raw_content_helper_text' => 'Можете користити потпуне HTML ознаке за дизајн свог блока. За CSS, требало би га додати у Изглед -> Прилагођени CSS и JS у Изглед -> Прилагођени JS.',
];
