<?php

return [
    'title' => 'חבר',
    'description' => 'צפה ועדכן הגדרות חברים',
    'verify_account_email' => 'לאמת את כתובת הדוא"ל של החשבון?',
    'verify_account_email_helper' => 'כאשר מופעל, קישור אימות יישלח לכתובת הדוא"ל של החשבון, לקוחות צריכים ללחוץ על קישור זה כדי לאמת את הדוא"ל שלהם לפני שהם יכולים להתחבר. יש להגדיר דוא"ל בניהול -> הגדרות -> דוא"ל כדי לשלוח דוא"ל אימות.',
    'verification_expire_minutes' => 'תפוגת קישור אימות (דקות)',
    'verification_expire_minutes_helper' => 'מספר הדקות שבהן יש לראות את קישור אימות הדוא"ל כתקף. ברירת המחדל היא 60 דקות (שעה אחת). המקסימום הוא 10080 דקות (7 ימים).',
    'enabled_login' => 'לאפשר למבקרים להתחבר?',
    'enabled_login_helper' => 'כאשר מופעל, מבקרים יכולים להתחבר לאתר שלך אם יש להם חשבון.',
    'enabled_registration' => 'לאפשר למבקרים להירשם לחשבון?',
    'enabled_registration_helper' => 'כאשר מופעל, מבקרים יכולים להירשם לחשבון באתר שלך.',
    'enable_post_approval' => 'להפעיל אישור פוסטים?',
    'enable_post_approval_helper' => 'כאשר מופעל, פוסטים שפורסמו על ידי סוכן יצטרכו לקבל אישור מהמנהל לפני שהם מתפרסמים ומוצגים באתר שלך.',
    'default_avatar' => 'תמונת פרופיל ברירת מחדל',
    'default_avatar_helper' => 'תמונת פרופיל ברירת מחדל לחבר כאשר אין לו תמונת פרופיל. אם לא תבחר תמונה כלשהי, היא תיווצר באמצעות הלוגו שלך או התו הראשון של שם החבר.',
    'show_terms_checkbox' => 'להציג תיבת סימון תנאים ומדיניות?',
    'show_terms_checkbox_helper' => 'כאשר מופעל, משתמשים יצטרכו להסכים לתנאים ולמדיניות הפרטיות שלך לפני שהם יכולים להירשם לחשבון.',
    'email' => [
        'templates' => [
            'confirm_email' => [
                'title' => 'אימות דוא"ל',
                'description' => 'שלח דוא"ל למשתמש כאשר הוא נרשם לחשבון כדי לאמת את הדוא"ל שלו',
                'subject' => 'הודעת אימות דוא"ל',
                'verify_link' => 'קישור לאימות דוא"ל',
                'member_name' => 'שם החבר',
            ],
            'password_reminder' => [
                'title' => 'איפוס סיסמה',
                'description' => 'שלח דוא"ל למשתמש בעת בקשת איפוס סיסמה',
                'subject' => 'איפוס סיסמה',
                'reset_link' => 'קישור לאיפוס סיסמה',
            ],
            'new_pending_post' => [
                'title' => 'פוסט חדש הממתין לאישור',
                'description' => 'שלח דוא"ל למנהל כאשר נוצר פוסט חדש',
                'subject' => 'פוסט חדש ממתין באתר {{ site_title }} מאת {{ post_author }}',
                'post_author' => 'מחבר הפוסט',
                'post_name' => 'שם הפוסט',
                'post_url' => 'כתובת URL של הפוסט',
            ],
        ],
    ],
];
