<?php

return [
    'name' => 'ব্লক',
    'create' => 'নতুন ব্লক',
    'menu' => 'স্ট্যাটিক ব্লক',
    'static_block_short_code_name' => 'স্ট্যাটিক ব্লক',
    'static_block_short_code_description' => 'একটি কাস্টম স্ট্যাটিক ব্লক যোগ করুন',
    'alias' => 'উপনাম',
    'content_helper_text' => 'এটি শুধুমাত্র টেক্সট, ছবি, তালিকা... হতে হবে। আপনি যদি বিশেষ HTML ট্যাগ ব্যবহার করতে চান, অনুগ্রহ করে কাঁচা কন্টেন্ট ফিল্ড ব্যবহার করুন। কাঁচা কন্টেন্ট ব্যবহার করা হলে এই ফিল্ডটি উপেক্ষা করা হবে।',
    'raw_content' => 'কাঁচা কন্টেন্ট (HTML ট্যাগ গৃহীত, CSS/JS নেই)',
    'raw_content_placeholder' => 'বিশেষ HTML কোডের জন্য...',
    'raw_content_helper_text' => 'আপনি আপনার ব্লক ডিজাইন করতে সম্পূর্ণ HTML ট্যাগ ব্যবহার করতে পারেন। CSS এর জন্য, আপনার এটি চেহারা -> কাস্টম CSS এ যোগ করা উচিত এবং JS চেহারা -> কাস্টম JS এ।',
];
