<?php

return [
    'title' => 'Учасник',
    'description' => 'Перегляд і оновлення налаштувань учасника',
    'verify_account_email' => 'Перевірити email облікового запису?',
    'verify_account_email_helper' => 'Коли увімкнено, на електронну пошту облікового запису буде надіслано посилання для підтвердження, клієнти повинні натиснути на це посилання, щоб підтвердити свій email перед входом. Необхідно налаштувати email в Адміністратор -> Налаштування -> Email для надсилання підтвердження електронною поштою.',
    'verification_expire_minutes' => 'Термін дії посилання підтвердження (хвилини)',
    'verification_expire_minutes_helper' => 'Кількість хвилин, протягом яких посилання підтвердження електронної пошти повинно вважатися дійсним. За замовчуванням 60 хвилин (1 година). Максимум 10080 хвилин (7 днів).',
    'enabled_login' => 'Дозволити відвідувачам входити?',
    'enabled_login_helper' => 'Коли увімкнено, відвідувачі можуть увійти на ваш сайт, якщо у них є обліковий запис.',
    'enabled_registration' => 'Дозволити відвідувачам реєструвати обліковий запис?',
    'enabled_registration_helper' => 'Коли увімкнено, відвідувачі можуть зареєструвати обліковий запис на вашому сайті.',
    'enable_post_approval' => 'Увімкнути затвердження постів?',
    'enable_post_approval_helper' => 'Коли увімкнено, властивості, опубліковані агентом, повинні бути затверджені адміністратором, перш ніж вони будуть опубліковані та відображені на вашому сайті.',
    'default_avatar' => 'Аватар за замовчуванням',
    'default_avatar_helper' => 'Аватар за замовчуванням для учасника, коли у нього немає аватара. Якщо ви не виберете зображення, воно буде згенеровано з використанням вашого логотипу або першого символу імені учасника.',
    'show_terms_checkbox' => 'Показати прапорець Умови та Політика?',
    'show_terms_checkbox_helper' => 'Коли увімкнено, користувачі повинні будуть погодитися з вашими Умовами та Політикою конфіденційності, перш ніж вони зможуть зареєструвати обліковий запис.',
    'email' => [
        'templates' => [
            'confirm_email' => [
                'title' => 'Підтвердити email',
                'description' => 'Надіслати email користувачу при реєстрації облікового запису для підтвердження їх email',
                'subject' => 'Сповіщення про підтвердження Email',
                'verify_link' => 'Посилання для підтвердження email',
                'member_name' => 'Ім\'я учасника',
            ],
            'password_reminder' => [
                'title' => 'Скидання пароля',
                'description' => 'Надіслати email користувачу при запиті скидання пароля',
                'subject' => 'Скидання пароля',
                'reset_link' => 'Посилання для скидання пароля',
            ],
            'new_pending_post' => [
                'title' => 'Новий пост в очікуванні',
                'description' => 'Надіслати email адміністратору при створенні нового посту',
                'subject' => 'Новий пост очікує на {{ site_title }} від {{ post_author }}',
                'post_author' => 'Автор посту',
                'post_name' => 'Назва посту',
                'post_url' => 'URL посту',
            ],
        ],
    ],
];
