<?php

return [
    'title' => 'Μέλος',
    'description' => 'Προβολή και ενημέρωση ρυθμίσεων μελών',
    'verify_account_email' => 'Επαλήθευση email λογαριασμού;',
    'verify_account_email_helper' => 'Όταν είναι ενεργοποιημένο, ένας σύνδεσμος επαλήθευσης θα σταλεί στο email του λογαριασμού, οι πελάτες πρέπει να κάνουν κλικ σε αυτόν τον σύνδεσμο για να επαληθεύσουν το email τους πριν μπορέσουν να συνδεθούν. Πρέπει να διαμορφώσετε το email στο Admin -> Ρυθμίσεις -> Email για να στείλετε επαλήθευση email.',
    'verification_expire_minutes' => 'Λήξη συνδέσμου επαλήθευσης (λεπτά)',
    'verification_expire_minutes_helper' => 'Ο αριθμός των λεπτών που ο σύνδεσμος επαλήθευσης email θα πρέπει να θεωρείται έγκυρος. Προεπιλογή είναι 60 λεπτά (1 ώρα). Μέγιστο είναι 10080 λεπτά (7 ημέρες).',
    'enabled_login' => 'Να επιτρέπεται η σύνδεση επισκεπτών;',
    'enabled_login_helper' => 'Όταν είναι ενεργοποιημένο, οι επισκέπτες μπορούν να συνδεθούν στον ιστότοπό σας εάν έχουν λογαριασμό.',
    'enabled_registration' => 'Να επιτρέπεται η εγγραφή επισκεπτών;',
    'enabled_registration_helper' => 'Όταν είναι ενεργοποιημένο, οι επισκέπτες μπορούν να εγγραφούν στον ιστότοπό σας.',
    'enable_post_approval' => 'Ενεργοποίηση έγκρισης δημοσιεύσεων;',
    'enable_post_approval_helper' => 'Όταν είναι ενεργοποιημένο, οι δημοσιεύσεις που δημοσιεύονται από έναν πράκτορα θα πρέπει να εγκριθούν από έναν διαχειριστή πριν δημοσιευτούν και εμφανιστούν στον ιστότοπό σας.',
    'default_avatar' => 'Προεπιλεγμένο avatar',
    'default_avatar_helper' => 'Προεπιλεγμένο avatar για μέλος όταν δεν έχει avatar. Εάν δεν επιλέξετε καμία εικόνα, θα δημιουργηθεί χρησιμοποιώντας το λογότυπό σας ή τον πρώτο χαρακτήρα του ονόματος μέλους.',
    'show_terms_checkbox' => 'Εμφάνιση πλαισίου ελέγχου όρων και πολιτικής;',
    'show_terms_checkbox_helper' => 'Όταν είναι ενεργοποιημένο, οι χρήστες θα πρέπει να συμφωνήσουν με τους όρους και την πολιτική απορρήτου σας πριν μπορέσουν να εγγραφούν.',
    'email' => [
        'templates' => [
            'confirm_email' => [
                'title' => 'Επιβεβαίωση email',
                'description' => 'Αποστολή email στον χρήστη όταν εγγραφεί για να επαληθεύσει το email του',
                'subject' => 'Ειδοποίηση επιβεβαίωσης email',
                'verify_link' => 'Σύνδεσμος επαλήθευσης email',
                'member_name' => 'Όνομα μέλους',
            ],
            'password_reminder' => [
                'title' => 'Επαναφορά κωδικού πρόσβασης',
                'description' => 'Αποστολή email στον χρήστη όταν ζητά επαναφορά κωδικού πρόσβασης',
                'subject' => 'Επαναφορά κωδικού πρόσβασης',
                'reset_link' => 'Σύνδεσμος επαναφοράς κωδικού πρόσβασης',
            ],
            'new_pending_post' => [
                'title' => 'Νέα εκκρεμής δημοσίευση',
                'description' => 'Αποστολή email στον διαχειριστή όταν δημιουργείται νέα δημοσίευση',
                'subject' => 'Νέα δημοσίευση εκκρεμεί στο {{ site_title }} από {{ post_author }}',
                'post_author' => 'Συγγραφέας δημοσίευσης',
                'post_name' => 'Όνομα δημοσίευσης',
                'post_url' => 'URL δημοσίευσης',
            ],
        ],
    ],
];
