<?php

return [
    'title' => 'عضو',
    'description' => 'عرض وتحديث إعدادات العضو',
    'verify_account_email' => 'التحقق من البريد الإلكتروني للحساب؟',
    'verify_account_email_helper' => 'عند تمكينه، سيتم إرسال رابط التحقق إلى البريد الإلكتروني للحساب، يحتاج العملاء إلى النقر على هذا الرابط للتحقق من بريدهم الإلكتروني قبل أن يتمكنوا من تسجيل الدخول. تحتاج إلى تكوين البريد الإلكتروني في المسؤول -> الإعدادات -> البريد الإلكتروني لإرسال التحقق من البريد الإلكتروني.',
    'verification_expire_minutes' => 'انتهاء صلاحية رابط التحقق (بالدقائق)',
    'verification_expire_minutes_helper' => 'عدد الدقائق التي يجب اعتبار رابط التحقق من البريد الإلكتروني صالحًا خلالها. الافتراضي هو 60 دقيقة (ساعة واحدة). الحد الأقصى هو 10080 دقيقة (7 أيام).',
    'enabled_login' => 'السماح للزوار بتسجيل الدخول؟',
    'enabled_login_helper' => 'عند تمكينه، يمكن للزوار تسجيل الدخول إلى موقعك إذا كان لديهم حساب.',
    'enabled_registration' => 'السماح للزوار بتسجيل حساب؟',
    'enabled_registration_helper' => 'عند تمكينه، يمكن للزوار تسجيل حساب على موقعك.',
    'enable_post_approval' => 'تمكين الموافقة على المنشورات؟',
    'enable_post_approval_helper' => 'عند تمكينه، ستحتاج الخصائص التي ينشرها الوكيل إلى الموافقة عليها من قبل المسؤول قبل نشرها وعرضها على موقعك.',
    'default_avatar' => 'الصورة الرمزية الافتراضية',
    'default_avatar_helper' => 'الصورة الرمزية الافتراضية للعضو عندما لا يكون لديه صورة رمزية. إذا لم تحدد أي صورة، فسيتم إنشاؤها باستخدام شعارك أو الحرف الأول من اسم العضو.',
    'show_terms_checkbox' => 'إظهار خانة اختيار الشروط والسياسة؟',
    'show_terms_checkbox_helper' => 'عند تمكينه، سيحتاج المستخدمون إلى الموافقة على الشروط وسياسة الخصوصية الخاصة بك قبل أن يتمكنوا من تسجيل حساب.',
    'email' => [
        'templates' => [
            'confirm_email' => [
                'title' => 'تأكيد البريد الإلكتروني',
                'description' => 'إرسال بريد إلكتروني للمستخدم عند تسجيل حساب للتحقق من بريده الإلكتروني',
                'subject' => 'إشعار تأكيد البريد الإلكتروني',
                'verify_link' => 'رابط التحقق من البريد الإلكتروني',
                'member_name' => 'اسم العضو',
            ],
            'password_reminder' => [
                'title' => 'إعادة تعيين كلمة المرور',
                'description' => 'إرسال بريد إلكتروني للمستخدم عند طلب إعادة تعيين كلمة المرور',
                'subject' => 'إعادة تعيين كلمة المرور',
                'reset_link' => 'رابط إعادة تعيين كلمة المرور',
            ],
            'new_pending_post' => [
                'title' => 'منشور جديد قيد الانتظار',
                'description' => 'إرسال بريد إلكتروني للمسؤول عند إنشاء منشور جديد',
                'subject' => 'منشور جديد قيد الانتظار على {{ site_title }} بواسطة {{ post_author }}',
                'post_author' => 'مؤلف المنشور',
                'post_name' => 'اسم المنشور',
                'post_url' => 'رابط المنشور',
            ],
        ],
    ],
];
