<?php

return [
    'name' => 'บล็อก',
    'create' => 'บล็อกใหม่',
    'menu' => 'บล็อกคงที่',
    'static_block_short_code_name' => 'บล็อกคงที่',
    'static_block_short_code_description' => 'เพิ่มบล็อกคงที่แบบกำหนดเอง',
    'alias' => 'นามแฝง',
    'content_helper_text' => 'ควรเป็นเพียงข้อความ รูปภาพ รายการ... เท่านั้น หากคุณต้องการใช้แท็ก HTML พิเศษ โปรดใช้ฟิลด์เนื้อหาดิบ ฟิลด์นี้จะถูกละเว้นหากใช้เนื้อหาดิบ',
    'raw_content' => 'เนื้อหาดิบ (แท็ก HTML ได้รับการยอมรับ ไม่มี CSS/JS)',
    'raw_content_placeholder' => 'สำหรับโค้ด HTML พิเศษ...',
    'raw_content_helper_text' => 'คุณสามารถใช้แท็ก HTML เต็มรูปแบบเพื่อออกแบบบล็อกของคุณ สำหรับ CSS คุณควรเพิ่มในรูปลักษณ์ -> CSS แบบกำหนดเอง และ JS ในรูปลักษณ์ -> JS แบบกำหนดเอง',
];
