<?php

return [
    'name' => 'Блок',
    'create' => 'Новый блок',
    'menu' => 'Статические блоки',
    'static_block_short_code_name' => 'Статический блок',
    'static_block_short_code_description' => 'Добавить пользовательский статический блок',
    'alias' => 'Псевдоним',
    'content_helper_text' => 'Это должен быть только текст, изображение, список... Если вы хотите использовать специальные HTML-теги, используйте поле Сырой контент. Это поле будет проигнорировано, если используется Сырой контент.',
    'raw_content' => 'Сырой контент (HTML-теги разрешены, без CSS/JS)',
    'raw_content_placeholder' => 'Для специального HTML-кода...',
    'raw_content_helper_text' => 'Вы можете использовать полные HTML-теги для оформления вашего блока. Для CSS вы должны добавить его в Внешний вид -> Пользовательский CSS и JS во Внешний вид -> Пользовательский JS.',
];
