<?php

return [
    'name' => 'ब्लॉक',
    'create' => 'नया ब्लॉक',
    'menu' => 'स्थिर ब्लॉक',
    'static_block_short_code_name' => 'स्थिर ब्लॉक',
    'static_block_short_code_description' => 'एक कस्टम स्थिर ब्लॉक जोड़ें',
    'alias' => 'उपनाम',
    'content_helper_text' => 'यह केवल टेक्स्ट, छवि, सूची... होना चाहिए। यदि आप विशेष HTML टैग का उपयोग करना चाहते हैं, तो कृपया कच्ची सामग्री फ़ील्ड का उपयोग करें। यदि कच्ची सामग्री का उपयोग किया जाता है तो इस फ़ील्ड को अनदेखा कर दिया जाएगा।',
    'raw_content' => 'कच्ची सामग्री (HTML टैग स्वीकृत, कोई CSS/JS नहीं)',
    'raw_content_placeholder' => 'विशेष HTML कोड के लिए...',
    'raw_content_helper_text' => 'आप अपने ब्लॉक को डिज़ाइन करने के लिए पूर्ण HTML टैग का उपयोग कर सकते हैं। CSS के लिए, आपको इसे दिखावट -> कस्टम CSS में जोड़ना चाहिए और JS को दिखावट -> कस्टम JS में।',
];
