<?php

return [
    'title' => 'Член',
    'description' => 'Преглед и актуализация на настройки за членове',
    'verify_account_email' => 'Потвърждение на имейла на акаунта?',
    'verify_account_email_helper' => 'Когато е активирано, връзка за потвърждение ще бъде изпратена на имейла на акаунта, клиентите трябва да кликнат на тази връзка, за да потвърдят своя имейл, преди да могат да влязат. Необходимо е да конфигурирате имейл в Администратор -> Настройки -> Имейл, за да изпращате имейли за потвърждение.',
    'verification_expire_minutes' => 'Изтичане на връзката за потвърждение (минути)',
    'verification_expire_minutes_helper' => 'Броят минути, през които връзката за потвърждение на имейл трябва да се счита за валидна. По подразбиране е 60 минути (1 час). Максимум е 10080 минути (7 дни).',
    'enabled_login' => 'Разрешаване на посетителите да влизат?',
    'enabled_login_helper' => 'Когато е активирано, посетителите могат да влязат във вашия сайт, ако имат акаунт.',
    'enabled_registration' => 'Разрешаване на посетителите да регистрират акаунт?',
    'enabled_registration_helper' => 'Когато е активирано, посетителите могат да регистрират акаунт във вашия сайт.',
    'enable_post_approval' => 'Активиране на одобрение на публикации?',
    'enable_post_approval_helper' => 'Когато е активирано, публикациите, публикувани от агент, ще трябва да бъдат одобрени от администратор, преди да бъдат публикувани и показани на вашия сайт.',
    'default_avatar' => 'Аватар по подразбиране',
    'default_avatar_helper' => 'Аватар по подразбиране за член, когато нямат аватар. Ако не изберете изображение, то ще бъде генерирано с вашето лого или първата буква от името на члена.',
    'show_terms_checkbox' => 'Показване на квадратче за условия и политика?',
    'show_terms_checkbox_helper' => 'Когато е активирано, потребителите ще трябва да се съгласят с вашите Условия и Политика за поверителност, преди да могат да регистрират акаунт.',
    'email' => [
        'templates' => [
            'confirm_email' => [
                'title' => 'Потвърждение на имейл',
                'description' => 'Изпращане на имейл до потребител, когато регистрират акаунт, за да потвърдят своя имейл',
                'subject' => 'Уведомление за потвърждение на имейл',
                'verify_link' => 'Връзка за потвърждение на имейл',
                'member_name' => 'Име на член',
            ],
            'password_reminder' => [
                'title' => 'Нулиране на парола',
                'description' => 'Изпращане на имейл до потребител при заявка за нулиране на парола',
                'subject' => 'Нулиране на парола',
                'reset_link' => 'Връзка за нулиране на парола',
            ],
            'new_pending_post' => [
                'title' => 'Нова публикация в изчакване',
                'description' => 'Изпращане на имейл до администратор, когато е създадена нова публикация',
                'subject' => 'Нова публикация в изчакване на {{ site_title }} от {{ post_author }}',
                'post_author' => 'Автор на публикацията',
                'post_name' => 'Име на публикацията',
                'post_url' => 'URL на публикацията',
            ],
        ],
    ],
];
