<?php

return [
    'name' => 'Μπλοκ',
    'create' => 'Νέο μπλοκ',
    'menu' => 'Στατικά μπλοκ',
    'static_block_short_code_name' => 'Στατικό μπλοκ',
    'static_block_short_code_description' => 'Προσθήκη προσαρμοσμένου στατικού μπλοκ',
    'alias' => 'Ψευδώνυμο',
    'content_helper_text' => 'Πρέπει να είναι μόνο κείμενο, εικόνα, λίστα... Εάν θέλετε να χρησιμοποιήσετε ειδικές ετικέτες HTML, χρησιμοποιήστε το πεδίο Ακατέργαστο περιεχόμενο. Αυτό το πεδίο θα αγνοηθεί εάν χρησιμοποιηθεί το Ακατέργαστο περιεχόμενο.',
    'raw_content' => 'Ακατέργαστο περιεχόμενο (ετικέτες HTML αποδεκτές, χωρίς CSS/JS)',
    'raw_content_placeholder' => 'Για ειδικό κώδικα HTML...',
    'raw_content_helper_text' => 'Μπορείτε να χρησιμοποιήσετε πλήρεις ετικέτες HTML για να σχεδιάσετε το μπλοκ σας. Για CSS, πρέπει να το προσθέσετε στην Εμφάνιση -> Προσαρμοσμένο CSS και JS στην Εμφάνιση -> Προσαρμοσμένο JS.',
];
