<?php

return [
    'admin_menu' => [
        'title' => 'Власні поля',
        'description' => 'Переглядати та керувати власними полями',
    ],

    'page_title' => 'Власні поля',

    'all_field_groups' => 'Усі групи полів',

    'form' => [
        'create_field_group' => 'Створити групу полів',
        'edit_field_group' => 'Редагувати групу полів',
        'field_items_information' => 'Інформація про елементи полів',

        'repeater_fields' => 'Повторювач',
        'add_field' => 'Додати поле',
        'remove_field' => 'Видалити поле',
        'close_field' => 'Закрити поле',
        'new_field' => 'Нове поле',

        'field_label' => 'Мітка',
        'field_label_helper' => 'Це заголовок елемента поля. Відображатиметься на сторінках редагування.',
        'field_name' => 'Назва поля',
        'field_name_helper' => 'Псевдонім елемента поля. Приймає цифри, символи та підкреслення.',
        'field_type' => 'Тип поля',
        'field_type_helper' => 'Будь ласка, виберіть тип цього поля.',
        'field_instructions' => 'Інструкції для поля',
        'field_instructions_helper' => 'Посібник з інструкціями, щоб користувач легше знав, що потрібно ввести.',

        'default_value' => 'Значення за замовчуванням',
        'default_value_helper' => 'Значення поля за замовчуванням, коли воно залишається порожнім',
        'placeholder' => 'Заповнювач',
        'placeholder_helper' => 'Текст заповнювача',
        'rows' => 'Рядки',
        'rows_helper' => 'Рядки цієї текстової області',
        'choices' => 'Варіанти',
        'choices_helper' => 'Введіть кожен варіант у новому рядку.<br>Для більшого контролю ви можете вказати як значення, так і мітку таким чином:<br>red: Червоний<br>blue: Синій',
        'button_label' => 'Кнопка для повторювача',
        'date_format' => 'Формат дати',
        'date_format_helper' => 'Виберіть формат відображення дат',
        'time_format' => 'Формат часу',
        'time_format_helper' => 'Виберіть формат відображення часу',

        'groups' => [
            'basic' => 'Основні',
            'content' => 'Вміст',
            'choice' => 'Варіанти',
            'other' => 'Інше',
        ],

        'types' => [
            'text' => 'Текстове поле',
            'textarea' => 'Текстова область',
            'number' => 'Число',
            'email' => 'Електронна пошта',
            'password' => 'Пароль',
            'url' => 'URL',
            'date' => 'Вибір дати',
            'datetime' => 'Вибір дати та часу',
            'time' => 'Вибір часу',
            'color' => 'Вибір кольору',
            'wysiwyg' => 'WYSIWYG редактор',
            'image' => 'Зображення',
            'file' => 'Файл',
            'select' => 'Вибір',
            'checkbox' => 'Прапорець',
            'radio' => 'Перемикач',
            'repeater' => 'Повторювач',
        ],

        'rules' => [
            'rules' => 'Правила відображення',
            'rules_helper' => 'Показати цю групу полів якщо',
            'add_rule_group' => 'Додати групу правил',
            'is_equal_to' => 'Дорівнює',
            'is_not_equal_to' => 'Не дорівнює',
            'and' => 'І',
            'or' => 'Або',
        ],
    ],

    'import' => 'Імпорт',
    'export' => 'Експорт',
    'publish' => 'Опублікувати',
    'remove_this_line' => 'Видалити цей рядок',
    'collapse_this_line' => 'Згорнути цей рядок',
    'error_occurred' => 'Сталася помилка',
    'request_completed' => 'Запит виконано',
    'item_not_existed' => 'Елемент не існує',
];
