<?php

return [
    'name' => 'Блок',
    'create' => 'Новий блок',
    'menu' => 'Статичні блоки',
    'static_block_short_code_name' => 'Статичний блок',
    'static_block_short_code_description' => 'Додати користувацький статичний блок',
    'alias' => 'Псевдонім',
    'content_helper_text' => 'Це має бути лише текст, зображення, список... Якщо ви хочете використовувати спеціальні HTML-теги, використовуйте поле Сирий вміст. Це поле буде проігноровано, якщо використовується Сирий вміст.',
    'raw_content' => 'Сирий вміст (HTML-теги дозволені, без CSS/JS)',
    'raw_content_placeholder' => 'Для спеціального HTML-коду...',
    'raw_content_helper_text' => 'Ви можете використовувати повні HTML-теги для оформлення вашого блоку. Для CSS ви повинні додати його у Зовнішній вигляд -> Користувацький CSS і JS у Зовнішній вигляд -> Користувацький JS.',
];
