<?php

return [
    'title' => 'সদস্য',
    'description' => 'সদস্য সেটিংস দেখুন এবং আপডেট করুন',
    'verify_account_email' => 'অ্যাকাউন্টের ইমেইল যাচাই করবেন?',
    'verify_account_email_helper' => 'যখন এটি সক্রিয় করা হয়, একটি যাচাইকরণ লিঙ্ক অ্যাকাউন্টের ইমেইলে পাঠানো হবে, গ্রাহকদের লগ ইন করার আগে তাদের ইমেইল যাচাই করতে এই লিঙ্কে ক্লিক করতে হবে। ইমেইল যাচাইকরণ পাঠাতে প্রশাসক -> সেটিংস -> ইমেইলে ইমেইল কনফিগার করা প্রয়োজন।',
    'verification_expire_minutes' => 'যাচাইকরণ লিঙ্ক মেয়াদ শেষ (মিনিট)',
    'verification_expire_minutes_helper' => 'ইমেইল যাচাইকরণ লিঙ্কটি কত মিনিট বৈধ বলে বিবেচিত হবে। ডিফল্ট হল ৬০ মিনিট (১ ঘন্টা)। সর্বোচ্চ ১০০৮০ মিনিট (৭ দিন)।',
    'enabled_login' => 'দর্শকদের লগইন করার অনুমতি দেবেন?',
    'enabled_login_helper' => 'যখন এটি সক্রিয় করা হয়, দর্শকরা তাদের অ্যাকাউন্ট থাকলে আপনার সাইটে লগ ইন করতে পারবেন।',
    'enabled_registration' => 'দর্শকদের অ্যাকাউন্ট নিবন্ধন করার অনুমতি দেবেন?',
    'enabled_registration_helper' => 'যখন এটি সক্রিয় করা হয়, দর্শকরা আপনার সাইটে একটি অ্যাকাউন্ট নিবন্ধন করতে পারবেন।',
    'enable_post_approval' => 'পোস্ট অনুমোদন সক্রিয় করবেন?',
    'enable_post_approval_helper' => 'যখন এটি সক্রিয় করা হয়, একজন এজেন্ট দ্বারা পোস্ট করা বৈশিষ্ট্যগুলি আপনার সাইটে প্রকাশিত এবং প্রদর্শিত হওয়ার আগে একজন প্রশাসক দ্বারা অনুমোদিত হতে হবে।',
    'default_avatar' => 'ডিফল্ট অবতার',
    'default_avatar_helper' => 'সদস্যের জন্য ডিফল্ট অবতার যখন তাদের কোন অবতার নেই। আপনি যদি কোন ছবি নির্বাচন না করেন, এটি আপনার লোগো বা সদস্যের নামের প্রথম অক্ষর ব্যবহার করে তৈরি হবে।',
    'show_terms_checkbox' => 'শর্তাবলী এবং নীতি চেকবক্স দেখাবেন?',
    'show_terms_checkbox_helper' => 'যখন এটি সক্রিয় করা হয়, ব্যবহারকারীদের একটি অ্যাকাউন্ট নিবন্ধন করার আগে আপনার শর্তাবলী এবং গোপনীয়তা নীতিতে সম্মত হতে হবে।',
    'email' => [
        'templates' => [
            'confirm_email' => [
                'title' => 'ইমেইল নিশ্চিত করুন',
                'description' => 'যখন ব্যবহারকারীরা একটি অ্যাকাউন্ট নিবন্ধন করেন তখন তাদের ইমেইল যাচাই করার জন্য ইমেইল পাঠান',
                'subject' => 'ইমেইল নিশ্চিতকরণ বিজ্ঞপ্তি',
                'verify_link' => 'ইমেইল যাচাই লিঙ্ক',
                'member_name' => 'সদস্যের নাম',
            ],
            'password_reminder' => [
                'title' => 'পাসওয়ার্ড রিসেট',
                'description' => 'পাসওয়ার্ড রিসেট অনুরোধ করার সময় ব্যবহারকারীকে ইমেইল পাঠান',
                'subject' => 'পাসওয়ার্ড রিসেট',
                'reset_link' => 'পাসওয়ার্ড রিসেট লিঙ্ক',
            ],
            'new_pending_post' => [
                'title' => 'নতুন অপেক্ষমাণ পোস্ট',
                'description' => 'যখন একটি নতুন পোস্ট তৈরি হয় তখন প্রশাসককে ইমেইল পাঠান',
                'subject' => '{{ site_title }}-এ {{ post_author }}-এর দ্বারা নতুন পোস্ট অপেক্ষমাণ',
                'post_author' => 'পোস্ট লেখক',
                'post_name' => 'পোস্টের নাম',
                'post_url' => 'পোস্ট URL',
            ],
        ],
    ],
];
