<?php

return [
    'title' => 'สมาชิก',
    'description' => 'ดูและอัปเดตการตั้งค่าสมาชิก',
    'verify_account_email' => 'ยืนยันอีเมลของบัญชี?',
    'verify_account_email_helper' => 'เมื่อเปิดใช้งาน ลิงก์ยืนยันจะถูกส่งไปยังอีเมลของบัญชี ลูกค้าจะต้องคลิกลิงก์นี้เพื่อยืนยันอีเมลของพวกเขาก่อนที่จะสามารถเข้าสู่ระบบได้ จำเป็นต้องกำหนดค่าอีเมลใน ผู้ดูแลระบบ -> การตั้งค่า -> อีเมล เพื่อส่งอีเมลยืนยัน',
    'verification_expire_minutes' => 'ลิงก์ยืนยันหมดอายุ (นาที)',
    'verification_expire_minutes_helper' => 'จำนวนนาทีที่ลิงก์ยืนยันอีเมลควรถือว่าใช้ได้ ค่าเริ่มต้นคือ 60 นาที (1 ชั่วโมง) สูงสุดคือ 10080 นาที (7 วัน)',
    'enabled_login' => 'อนุญาตให้ผู้เยี่ยมชมเข้าสู่ระบบ?',
    'enabled_login_helper' => 'เมื่อเปิดใช้งาน ผู้เยี่ยมชมสามารถเข้าสู่ระบบเว็บไซต์ของคุณได้หากพวกเขามีบัญชี',
    'enabled_registration' => 'อนุญาตให้ผู้เยี่ยมชมลงทะเบียนบัญชี?',
    'enabled_registration_helper' => 'เมื่อเปิดใช้งาน ผู้เยี่ยมชมสามารถลงทะเบียนบัญชีบนเว็บไซต์ของคุณได้',
    'enable_post_approval' => 'เปิดใช้งานการอนุมัติโพสต์?',
    'enable_post_approval_helper' => 'เมื่อเปิดใช้งาน โพสต์ที่โพสต์โดยตัวแทนจะต้องได้รับการอนุมัติจากผู้ดูแลระบบก่อนที่จะเผยแพร่และแสดงบนเว็บไซต์ของคุณ',
    'default_avatar' => 'อวตารเริ่มต้น',
    'default_avatar_helper' => 'อวตารเริ่มต้นสำหรับสมาชิกเมื่อพวกเขาไม่มีอวตาร์ หากคุณไม่เลือกรูปภาพใดๆ ระบบจะสร้างโดยใช้โลโก้ของคุณหรืออักขระตัวแรกของชื่อสมาชิก',
    'show_terms_checkbox' => 'แสดงช่องทำเครื่องหมายข้อกำหนดและนโยบาย?',
    'show_terms_checkbox_helper' => 'เมื่อเปิดใช้งาน ผู้ใช้จะต้องยอมรับข้อกำหนดและนโยบายความเป็นส่วนตัวของคุณก่อนที่พวกเขาจะสามารถลงทะเบียนบัญชีได้',
    'email' => [
        'templates' => [
            'confirm_email' => [
                'title' => 'ยืนยันอีเมล',
                'description' => 'ส่งอีเมลถึงผู้ใช้เมื่อพวกเขาลงทะเบียนบัญชีเพื่อยืนยันอีเมลของพวกเขา',
                'subject' => 'การแจ้งเตือนการยืนยันอีเมล',
                'verify_link' => 'ลิงก์ยืนยันอีเมล',
                'member_name' => 'ชื่อสมาชิก',
            ],
            'password_reminder' => [
                'title' => 'รีเซ็ตรหัสผ่าน',
                'description' => 'ส่งอีเมลถึงผู้ใช้เมื่อขอรีเซ็ตรหัสผ่าน',
                'subject' => 'รีเซ็ตรหัสผ่าน',
                'reset_link' => 'ลิงก์รีเซ็ตรหัสผ่าน',
            ],
            'new_pending_post' => [
                'title' => 'โพสต์ที่รอดำเนินการใหม่',
                'description' => 'ส่งอีเมลถึงผู้ดูแลระบบเมื่อมีการสร้างโพสต์ใหม่',
                'subject' => 'โพสต์ใหม่กำลังรอดำเนินการบน {{ site_title }} โดย {{ post_author }}',
                'post_author' => 'ผู้เขียนโพสต์',
                'post_name' => 'ชื่อโพสต์',
                'post_url' => 'URL โพสต์',
            ],
        ],
    ],
];
