<?php

return [
    'title' => 'सदस्य',
    'description' => 'सदस्य सेटिंग्स देखें और अपडेट करें',
    'verify_account_email' => 'खाते का ईमेल सत्यापित करें?',
    'verify_account_email_helper' => 'जब यह सक्षम हो, तो खाते के ईमेल पर एक सत्यापन लिंक भेजा जाएगा, ग्राहकों को लॉग इन करने से पहले अपना ईमेल सत्यापित करने के लिए इस लिंक पर क्लिक करना होगा। ईमेल सत्यापन भेजने के लिए व्यवस्थापक -> सेटिंग्स -> ईमेल में ईमेल कॉन्फ़िगर करना होगा।',
    'verification_expire_minutes' => 'सत्यापन लिंक समाप्ति (मिनट)',
    'verification_expire_minutes_helper' => 'मिनटों की संख्या जिसके लिए ईमेल सत्यापन लिंक को वैध माना जाना चाहिए। डिफ़ॉल्ट 60 मिनट (1 घंटा) है। अधिकतम 10080 मिनट (7 दिन) है।',
    'enabled_login' => 'आगंतुकों को लॉग इन करने की अनुमति दें?',
    'enabled_login_helper' => 'जब यह सक्षम हो, तो आगंतुक आपकी साइट पर लॉग इन कर सकते हैं यदि उनके पास खाता है।',
    'enabled_registration' => 'आगंतुकों को खाता पंजीकृत करने की अनुमति दें?',
    'enabled_registration_helper' => 'जब यह सक्षम हो, तो आगंतुक आपकी साइट पर एक खाता पंजीकृत कर सकते हैं।',
    'enable_post_approval' => 'पोस्ट अनुमोदन सक्षम करें?',
    'enable_post_approval_helper' => 'जब यह सक्षम हो, तो एक एजेंट द्वारा पोस्ट की गई संपत्तियों को प्रकाशित होने और आपकी साइट पर प्रदर्शित होने से पहले एक व्यवस्थापक द्वारा अनुमोदित करने की आवश्यकता होगी।',
    'default_avatar' => 'डिफ़ॉल्ट अवतार',
    'default_avatar_helper' => 'सदस्य के लिए डिफ़ॉल्ट अवतार जब उनके पास अवतार नहीं है। यदि आप कोई छवि नहीं चुनते हैं, तो यह आपके लोगो या सदस्य नाम के पहले अक्षर का उपयोग करके बनाया जाएगा।',
    'show_terms_checkbox' => 'नियम और नीति चेकबॉक्स दिखाएं?',
    'show_terms_checkbox_helper' => 'जब यह सक्षम हो, तो उपयोगकर्ताओं को खाता पंजीकृत करने से पहले आपकी शर्तों और गोपनीयता नीति से सहमत होना होगा।',
    'email' => [
        'templates' => [
            'confirm_email' => [
                'title' => 'ईमेल की पुष्टि करें',
                'description' => 'जब उपयोगकर्ता खाता पंजीकृत करता है तो उसके ईमेल की पुष्टि के लिए ईमेल भेजें',
                'subject' => 'ईमेल पुष्टिकरण अधिसूचना',
                'verify_link' => 'ईमेल सत्यापन लिंक',
                'member_name' => 'सदस्य का नाम',
            ],
            'password_reminder' => [
                'title' => 'पासवर्ड रीसेट करें',
                'description' => 'जब पासवर्ड रीसेट का अनुरोध किया जाता है तो उपयोगकर्ता को ईमेल भेजें',
                'subject' => 'पासवर्ड रीसेट करें',
                'reset_link' => 'पासवर्ड रीसेट लिंक',
            ],
            'new_pending_post' => [
                'title' => 'नई लंबित पोस्ट',
                'description' => 'जब एक नई पोस्ट बनाई जाती है तो व्यवस्थापक को ईमेल भेजें',
                'subject' => '{{ site_title }} पर {{ post_author }} द्वारा नई पोस्ट लंबित है',
                'post_author' => 'पोस्ट लेखक',
                'post_name' => 'पोस्ट का नाम',
                'post_url' => 'पोस्ट URL',
            ],
        ],
    ],
];
