<?php

return [
    'name' => 'ბლოკი',
    'create' => 'ახალი ბლოკი',
    'menu' => 'სტატიკური ბლოკები',
    'static_block_short_code_name' => 'სტატიკური ბლოკი',
    'static_block_short_code_description' => 'მორგებული სტატიკური ბლოკის დამატება',
    'alias' => 'მეტსახელი',
    'content_helper_text' => 'ეს უნდა იყოს მხოლოდ ტექსტი, სურათი, სია... თუ გსურთ სპეციალური HTML ტეგების გამოყენება, გთხოვთ გამოიყენოთ ნედლი შინაარსის ველი. ეს ველი იგნორირებული იქნება, თუ ნედლი შინაარსი გამოიყენება.',
    'raw_content' => 'ნედლი შინაარსი (HTML ტეგები მიღებულია, CSS/JS გარეშე)',
    'raw_content_placeholder' => 'სპეციალური HTML კოდისთვის...',
    'raw_content_helper_text' => 'თქვენ შეგიძლიათ გამოიყენოთ სრული HTML ტეგები თქვენი ბლოკის დიზაინისთვის. CSS-ისთვის, თქვენ უნდა დაამატოთ ის გარეგნობა -> მორგებული CSS-ში და JS გარეგნობა -> მორგებული JS-ში.',
];
