<?php

return [
    'admin_menu' => [
        'title' => 'Персонализирани полета',
        'description' => 'Преглед и управление на персонализирани полета',
    ],

    'page_title' => 'Персонализирани полета',

    'all_field_groups' => 'Всички групи полета',

    'form' => [
        'create_field_group' => 'Създаване на група полета',
        'edit_field_group' => 'Редактиране на група полета',
        'field_items_information' => 'Информация за елементи на полета',

        'repeater_fields' => 'Повторител',
        'add_field' => 'Добавяне на поле',
        'remove_field' => 'Премахване на поле',
        'close_field' => 'Затваряне на поле',
        'new_field' => 'Нов поле',

        'field_label' => 'Етикет',
        'field_label_helper' => 'Това е заглавието на елемента на полето. Ще бъде показано на страниците за редактиране.',
        'field_name' => 'Име на полето',
        'field_name_helper' => 'Псевдонимът на елемента на полето. Приема числа, знаци и долна черта.',
        'field_type' => 'Тип на полето',
        'field_type_helper' => 'Моля, изберете типа на това поле.',
        'field_instructions' => 'Инструкции за полето',
        'field_instructions_helper' => 'Ръководство с инструкции, за да знае потребителят по-лесно какво трябва да въведе.',

        'default_value' => 'Стойност по подразбиране',
        'default_value_helper' => 'Стойността по подразбиране на полето, когато е оставено празно',
        'placeholder' => 'Заместител',
        'placeholder_helper' => 'Текст на заместителя',
        'rows' => 'Редове',
        'rows_helper' => 'Редове на това текстово поле',
        'choices' => 'Избори',
        'choices_helper' => 'Въведете всеки избор на нов ред.<br>За по-голям контрол можете да посочите както стойност, така и етикет така:<br>red: Червено<br>blue: Синьо',
        'button_label' => 'Бутон за повторител',
        'date_format' => 'Формат на датата',
        'date_format_helper' => 'Изберете формата на показване на датите',
        'time_format' => 'Формат на часа',
        'time_format_helper' => 'Изберете формата на показване на часа',

        'groups' => [
            'basic' => 'Основни',
            'content' => 'Съдържание',
            'choice' => 'Избори',
            'other' => 'Други',
        ],

        'types' => [
            'text' => 'Текстово поле',
            'textarea' => 'Текстова област',
            'number' => 'Число',
            'email' => 'Имейл',
            'password' => 'Парола',
            'url' => 'URL адрес',
            'date' => 'Избор на дата',
            'datetime' => 'Избор на дата и час',
            'time' => 'Избор на час',
            'color' => 'Избор на цвят',
            'wysiwyg' => 'WYSIWYG редактор',
            'image' => 'Изображение',
            'file' => 'Файл',
            'select' => 'Избор',
            'checkbox' => 'Квадратче за отметка',
            'radio' => 'Радио бутон',
            'repeater' => 'Повторител',
        ],

        'rules' => [
            'rules' => 'Правила за показване',
            'rules_helper' => 'Показване на тази група полета ако',
            'add_rule_group' => 'Добавяне на група правила',
            'is_equal_to' => 'Равно на',
            'is_not_equal_to' => 'Не е равно на',
            'and' => 'И',
            'or' => 'Или',
        ],
    ],

    'import' => 'Импортиране',
    'export' => 'Експортиране',
    'publish' => 'Публикуване',
    'remove_this_line' => 'Премахване на този ред',
    'collapse_this_line' => 'Свиване на този ред',
    'error_occurred' => 'Възникна грешка',
    'request_completed' => 'Заявката е завършена',
    'item_not_existed' => 'Елементът не съществува',
];
