<?php

return [
    'title' => 'Члан',
    'description' => 'Прегледајте и ажурирајте подешавања чланова',
    'verify_account_email' => 'Верификујте е-пошту налога?',
    'verify_account_email_helper' => 'Када је омогућено, линк за верификацију ће бити послат на е-пошту налога, купци морају кликнути на овај линк да верификују своју е-пошту пре него што се могу пријавити. Потребно је конфигурисати е-пошту у Админ -> Подешавања -> Е-пошта за слање е-поште за верификацију.',
    'verification_expire_minutes' => 'Истек линка за верификацију (минути)',
    'verification_expire_minutes_helper' => 'Број минута у којима треба да линк за верификацију е-поште буде важећи. Подразумевано је 60 минута (1 сат). Максимално је 10080 минута (7 дана).',
    'enabled_login' => 'Дозволити посетиоцима да се пријаве?',
    'enabled_login_helper' => 'Када је омогућено, посетиоци могу да се пријаве на вашу веб локацију ако имају налог.',
    'enabled_registration' => 'Дозволити посетиоцима да региструју налог?',
    'enabled_registration_helper' => 'Када је омогућено, посетиоци могу да региструју налог на вашој веб локацији.',
    'enable_post_approval' => 'Омогућити одобравање објава?',
    'enable_post_approval_helper' => 'Када је омогућено, објаве које објави агент ће морати да буду одобрене од стране администратора пре него што буду објављене и приказане на вашој веб локацији.',
    'default_avatar' => 'Подразумевани аватар',
    'default_avatar_helper' => 'Подразумевани аватар за члана када нема аватар. Ако не изаберете ниједну слику, биће генерисан коришћењем вашег логотипа или првог карактера имена члана.',
    'show_terms_checkbox' => 'Прикажи поље за потврду услова и политике?',
    'show_terms_checkbox_helper' => 'Када је омогућено, корисници ће морати да се сложе са вашим условима и политиком приватности пре него што могу да региструју налог.',
    'email' => [
        'templates' => [
            'confirm_email' => [
                'title' => 'Потврдите е-пошту',
                'description' => 'Пошаљите е-пошту кориснику када се региструје за налог да верификује своју е-пошту',
                'subject' => 'Обавештење о потврди е-поште',
                'verify_link' => 'Линк за верификацију е-поште',
                'member_name' => 'Име члана',
            ],
            'password_reminder' => [
                'title' => 'Ресетовање лозинке',
                'description' => 'Пошаљите е-пошту кориснику када захтева ресетовање лозинке',
                'subject' => 'Ресетовање лозинке',
                'reset_link' => 'Линк за ресетовање лозинке',
            ],
            'new_pending_post' => [
                'title' => 'Нова објава на чекању',
                'description' => 'Пошаљите е-пошту администратору када је креирана нова објава',
                'subject' => 'Нова објава чека на {{ site_title }} од {{ post_author }}',
                'post_author' => 'Аутор објаве',
                'post_name' => 'Назив објаве',
                'post_url' => 'УРЛ објаве',
            ],
        ],
    ],
];
