<?php

return [
    'name' => 'Блок',
    'create' => 'Нов блок',
    'menu' => 'Статични блокове',
    'static_block_short_code_name' => 'Статичен блок',
    'static_block_short_code_description' => 'Добавяне на персонализиран статичен блок',
    'alias' => 'Псевдоним',
    'content_helper_text' => 'Трябва да бъде само текст, изображение, списък... Ако искате да използвате специални HTML тагове, моля използвайте полето Суров съдържание. Това поле ще бъде игнорирано, ако се използва Суров съдържание.',
    'raw_content' => 'Суров съдържание (HTML тагове приети, без CSS/JS)',
    'raw_content_placeholder' => 'За специален HTML код...',
    'raw_content_helper_text' => 'Можете да използвате пълни HTML тагове за дизайн на вашия блок. За CSS трябва да го добавите в Външен вид -> Персонализиран CSS и JS във Външен вид -> Персонализиран JS.',
];
