<?php

return [
    'admin_menu' => [
        'title' => 'Προσαρμοσμένα Πεδία',
        'description' => 'Προβολή και διαχείριση Προσαρμοσμένων Πεδίων',
    ],

    'page_title' => 'Προσαρμοσμένα Πεδία',

    'all_field_groups' => 'Όλες οι ομάδες πεδίων',

    'form' => [
        'create_field_group' => 'Δημιουργία ομάδας πεδίων',
        'edit_field_group' => 'Επεξεργασία ομάδας πεδίων',
        'field_items_information' => 'Πληροφορίες στοιχείων πεδίων',

        'repeater_fields' => 'Επαναλαμβανόμενο',
        'add_field' => 'Προσθήκη πεδίου',
        'remove_field' => 'Αφαίρεση πεδίου',
        'close_field' => 'Κλείσιμο πεδίου',
        'new_field' => 'Νέο πεδίο',

        'field_label' => 'Ετικέτα',
        'field_label_helper' => 'Αυτός είναι ο τίτλος του στοιχείου πεδίου. Θα εμφανίζεται στις σελίδες επεξεργασίας.',
        'field_name' => 'Όνομα πεδίου',
        'field_name_helper' => 'Το ψευδώνυμο του στοιχείου πεδίου. Αποδεκτοί αριθμοί, χαρακτήρες και κάτω παύλα.',
        'field_type' => 'Τύπος πεδίου',
        'field_type_helper' => 'Επιλέξτε τον τύπο αυτού του πεδίου.',
        'field_instructions' => 'Οδηγίες πεδίου',
        'field_instructions_helper' => 'Οι οδηγίες καθοδήγησης για τον χρήστη να γνωρίζει ευκολότερα τι πρέπει να εισάγει.',

        'default_value' => 'Προεπιλεγμένη τιμή',
        'default_value_helper' => 'Η προεπιλεγμένη τιμή του πεδίου όταν μένει κενό',
        'placeholder' => 'Κείμενο υπόδειξης',
        'placeholder_helper' => 'Κείμενο υπόδειξης',
        'rows' => 'Γραμμές',
        'rows_helper' => 'Γραμμές αυτής της περιοχής κειμένου',
        'choices' => 'Επιλογές',
        'choices_helper' => 'Εισάγετε κάθε επιλογή σε νέα γραμμή.<br>Για περισσότερο έλεγχο, μπορείτε να καθορίσετε τόσο μια τιμή όσο και μια ετικέτα όπως:<br>red: Κόκκινο<br>blue: Μπλε',
        'button_label' => 'Κουμπί για επαναλαμβανόμενο',
        'date_format' => 'Μορφή ημερομηνίας',
        'date_format_helper' => 'Επιλέξτε τη μορφή εμφάνισης για ημερομηνίες',
        'time_format' => 'Μορφή ώρας',
        'time_format_helper' => 'Επιλέξτε τη μορφή εμφάνισης για την ώρα',

        'groups' => [
            'basic' => 'Βασικά',
            'content' => 'Περιεχόμενο',
            'choice' => 'Επιλογές',
            'other' => 'Άλλο',
        ],

        'types' => [
            'text' => 'Πεδίο κειμένου',
            'textarea' => 'Περιοχή κειμένου',
            'number' => 'Αριθμός',
            'email' => 'Email',
            'password' => 'Κωδικός πρόσβασης',
            'url' => 'URL',
            'date' => 'Επιλογέας ημερομηνίας',
            'datetime' => 'Επιλογέας ημερομηνίας & ώρας',
            'time' => 'Επιλογέας ώρας',
            'color' => 'Επιλογέας χρώματος',
            'wysiwyg' => 'Επεξεργαστής WYSIWYG',
            'image' => 'Εικόνα',
            'file' => 'Αρχείο',
            'select' => 'Επιλογή',
            'checkbox' => 'Πλαίσιο ελέγχου',
            'radio' => 'Κουμπί επιλογής',
            'repeater' => 'Επαναλαμβανόμενο',
        ],

        'rules' => [
            'rules' => 'Κανόνες εμφάνισης',
            'rules_helper' => 'Εμφάνιση αυτής της ομάδας πεδίων εάν',
            'add_rule_group' => 'Προσθήκη ομάδας κανόνων',
            'is_equal_to' => 'Ίσο με',
            'is_not_equal_to' => 'Όχι ίσο με',
            'and' => 'Και',
            'or' => 'Ή',
        ],
    ],

    'import' => 'Εισαγωγή',
    'export' => 'Εξαγωγή',
    'publish' => 'Δημοσίευση',
    'remove_this_line' => 'Αφαίρεση αυτής της γραμμής',
    'collapse_this_line' => 'Σύμπτυξη αυτής της γραμμής',
    'error_occurred' => 'Παρουσιάστηκε σφάλμα',
    'request_completed' => 'Το αίτημα ολοκληρώθηκε',
    'item_not_existed' => 'Το στοιχείο δεν υπάρχει',
];
